Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/usci_a_spi.c
        assert(  (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == param->clockPolarity) ||
                 (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW == param->clockPolarity)
                 );

        //Disable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCSWRST;

        //Reset OFS_UCAxCTL0 values
        HWREG8(baseAddress + OFS_UCAxCTL0) &= ~(UCCKPH + UCCKPL + UC7BIT + UCMSB +
                                                UCMST + UCMODE_3 + UCSYNC);

        //Reset OFS_UCAxCTL1 values
        HWREG8(baseAddress + OFS_UCAxCTL1) &= ~(UCSSEL_3);

        //Select Clock
        HWREG8(baseAddress + OFS_UCAxCTL1) |= param->selectClockSource;

        HWREG16(baseAddress + OFS_UCAxBRW) =
                (uint16_t)(param->clockSourceFrequency / param->desiredSpiClock);

        /*
         * Configure as SPI master mode.
         * Clock phase select, polarity, msb
         * UCMST = Master mode
         * UCSYNC = Synchronous mode
         * UCMODE_0 = 3-pin SPI
         */
        HWREG8(baseAddress + OFS_UCAxCTL0) |= (
                param->msbFirst +
                param->clockPhase +
                param->clockPolarity +
                UCMST +
                UCSYNC +
                UCMODE_0
                );
        //No modulation
        HWREG8(baseAddress + OFS_UCAxMCTL) = 0;

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the SPI Master clock.At the end of this
//! function call, SPI module is left enabled.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param clockSourceFrequency is the frequency of the selected clock source
//! \param desiredSpiClock is the desired clock rate for SPI communication
//!
//! Modified bits of \b UCAxBRW register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_SPI_masterChangeClock(uint16_t baseAddress,
                                  uint32_t clockSourceFrequency,
                                  uint32_t desiredSpiClock
                                  )
{
        USCI_A_SPI_changeMasterClockParam param = { 0 };

        param.clockSourceFrequency = clockSourceFrequency;
        param.desiredSpiClock = desiredSpiClock;

        USCI_A_SPI_changeMasterClock(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the SPI Master clock.At the end of this function call,
//! SPI module is left enabled.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param param is the pointer to struct for master clock setting.
//!
//! Modified bits of \b UCAxBRW register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_SPI_changeMasterClock(uint16_t baseAddress,
                                  USCI_A_SPI_changeMasterClockParam *param)
{
        assert(param != 0);

        //Disable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCSWRST;

        HWREG8(baseAddress + OFS_UCAxBRW) =
                (uint16_t)(param->clockSourceFrequency / param->desiredSpiClock);

        //Reset the UCSWRST bit to enable the USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1) &= ~(UCSWRST);
}
//*****************************************************************************
//
//! \brief Initializes the SPI Slave block.
//!
//! Upon successful initialization of the SPI slave block, this function will
//! have initialized the slave block, but the SPI Slave block still remains
//! disabled and must be enabled with USCI_A_SPI_enable()
//!
//! \param baseAddress is the base address of the SPI Slave module.
//! \param msbFirst controls the direction of the receive and transmit shift
//!        register.
//!        Valid values are:
//!        - \b USCI_A_SPI_MSB_FIRST
//!        - \b USCI_A_SPI_LSB_FIRST [Default]
//! \param clockPhase is clock phase select.
//!        Valid values are:
//!        - \b USCI_A_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT
//!           [Default]
//!        - \b USCI_A_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT
//! \param clockPolarity
//!        Valid values are:
//!        - \b USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_HIGH
//!        - \b USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW [Default]
//!
//! Modified bits are \b UCMSB, \b UCMST, \b UC7BIT, \b UCCKPL, \b UCCKPH and
//! \b UCMODE of \b UCAxCTL0 register; bits \b UCSWRST of \b UCAxCTL1 register.
//!
//! \return STATUS_SUCCESS
//
//*****************************************************************************
bool USCI_A_SPI_slaveInit(uint16_t baseAddress,
                          uint8_t msbFirst,
                          uint8_t clockPhase,
                          uint8_t clockPolarity
                          )
{
        assert(
                (USCI_A_SPI_MSB_FIRST == msbFirst) ||
                (USCI_A_SPI_LSB_FIRST == msbFirst)
                );

        assert(
                (USCI_A_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT == clockPhase) ||
                (USCI_A_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT == clockPhase)
                );

        assert(
                (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == clockPolarity) ||
                (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW == clockPolarity)
                );

        //Disable USCI Module
        HWREG8(baseAddress + OFS_UCAxCTL1)  |= UCSWRST;

        //Reset OFS_UCAxCTL0 register
        HWREG8(baseAddress + OFS_UCAxCTL0) &= ~(UCMSB +
                                                UC7BIT +
                                                UCMST +
                                                UCCKPL +
                                                UCCKPH +
                                                UCMODE_3
                                                );

        //Clock polarity, phase select, msbFirst, SYNC, Mode0
        HWREG8(baseAddress + OFS_UCAxCTL0) |= (clockPhase +
                                               clockPolarity +
                                               msbFirst +
                                               UCSYNC +
                                               UCMODE_0
                                               );

        return STATUS_SUCCESS;
}

//*****************************************************************************
//
//! \brief Changes the SPI clock phase and polarity.At the end of this function
//! call, SPI module is left enabled.
//!
//! \param baseAddress is the base address of the I2C Master module.
//! \param clockPhase is clock phase select.
//!        Valid values are:
//!        - \b USCI_A_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT
//!           [Default]
//!        - \b USCI_A_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT
//! \param clockPolarity
//!        Valid values are:
//!        - \b USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_HIGH
//!        - \b USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW [Default]
//!
//! Modified bits are \b UCCKPL and \b UCCKPH of \b UCAxCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_A_SPI_changeClockPhasePolarity(uint16_t baseAddress,
                                         uint8_t clockPhase,
                                         uint8_t clockPolarity
                                         )
{

        assert(  (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_HIGH == clockPolarity) ||
                 (USCI_A_SPI_CLOCKPOLARITY_INACTIVITY_LOW == clockPolarity)
                 );

